// noinspection ES6PreferShortImport

const updateObj: {
	v: string,
	data: string[]
}[] = [
	{
		v: "更早",
		data: ["增加了「更新记录」模块。"]
	},
	{
		v: "147.2.1",
		data: [
			"更新了readme.md，替换了默认的意义不清的文档。",
			"明确了全部部署地址：GitHub Pages、Cloudflare Pages、Vercel、Netlify。"
		]
	},
	{
		v: "148.0.1",
		data: [
			"修复了在宽屏状态下，由于浏览器缩放比例不为“100%”时可能导致的导航错乱问题。",
			"域名mtkit.top已通过ICP备案，通过腾讯云EdgeOne Pages服务部署，已同步更新至GitHub仓库资料页。",
			"新增乐理计算模块music12.js引导GitHub仓库页面。",
			"新增设置界面（仅新增占位格子，内容待更新）。"
		]
	},
	{
		v: "148.0.2",
		data: [
			"美化了「关于作者」模块的内容，新增二维码引导。",
			"新增了「关于作者」模块中打赏/赞助的页面。",
			"修复了「更新记录」模块卡片可能的顺序错误（useMemo依赖问题）。",
			"修复了「音程查询」模块中宽屏音程上下行颠倒显示的Bug。",
		]
	},
	{
		v: "148.1.0",
		data: [
			"修复了乐理计算模块中「小六和弦」和「大九降十三和弦」的音程显示Bug。感谢B站「@林小溪本溪」的反馈。",
			"将「重置应用」功能由「关于项目」模块转移到「设置」模块。",
			"修复了「音程查询」模块在特定情况下向控制台输出垃圾信息的Bug。",
			"修复了在特定情况下提示复制成功但无法写入剪贴板的Bug。",
			"修复了某些字体缺失的Bug。",
			"修复了错别字「Cloudflare Pages」。",
			"为一些二维码增添了中心图标或Logo，使二维码更加生动。",
			"确定新增MIDI功能和声音播放功能，占位以供下次更新。",
			"完成比完美更重要。所以再刷了一次版本号。",
		]
	},
	{
		v: "148.1.1",
		data: [
			"有一些错别字PTSD。",
		]
	},
	{
		v: "148.1.2",
		data: [
			"优化了部分js拆包动作，会使加载更加流畅。",
			"整理了部分不必要的包引用，缩减了体积。",
			"在「重置应用」时，增加了随机的时间拖延和视觉优化，没有任何实际作用，但增加了情绪价值。",
		]
	},
	{
		v: "148.1.3",
		data: [
			"优化了在首屏加载时，如卡住不动的文案引导。",
			"再次优化了无用的动画，增加了情绪价值。",
		]
	},
	{
		v: "148.1.4",
		data: [
			"优化了「音程查询」模块特定情况下1px像素偏差的Bug，并优化了切换动画。",
		]
	},
	{
		v: "149.0.1",
		data: [
			"重要更新：新增乐器选择，在音阶界面会有音响效果。",
			"调整了部分表述，减少了歧义。",
			"修复了部署到GitHub Pages时的路径Bug导致无法加载声音的问题。",
			"适配了宽屏下音阶界面的播放。",
		]
	},
	{
		v: "149.0.2",
		data: [
			"重要更新：和弦界面新增播放功能。",
			"在「设置」模块中，对乐器新增了「随机」和「轮换」选项。",
			"优化了「readme.md」中部分表述。",
			"更新了部分引用Library的版本。",
		]
	},
	{
		v: "149.0.3",
		data: [
			"优化了「五度圈」的步长选择界面。",
		]
	},
	{
		v: "149.0.4",
		data: [
			"新增了「识谱辅助」界面的播放按钮。",
			"新增了「251查询」界面的播放按钮。",
			"优化了「音阶升降号查询」界面的动画，提升了情绪价值。",
		]
	},
	{
		v: "149.0.5",
		data: [
			"优化了「和弦详情」界面的乐谱展示，解决了在某些极端情况下音符显示不全的Bug。",
		]
	},
	{
		v: "149.0.6",
		data: [
			"优化了当八度调整后和弦播放有时错乱的Bug。",
			"优化了「五度圈」在移动设备显示时，部分按键按下之后依然保留hover的Bug。",
			"优化了字体库，尽可能缩减大小，并优化了字符显示。",
		]
	},
	{
		v: "149.0.7",
		data: [
			"再一次优化了「五度圈」的界面样式。",
			"优化了「音阶查询」界面的部分逻辑。",
		]
	},
	{
		v: "149.0.8",
		data: [
			"优化了「和弦查询」模块中，点击和弦选择界面时记住上次的位置，方便操作。",
			"优化了部分界面和逻辑操作。",
		]
	},
	{
		v: "149.0.9",
		data: [
			"优化了打包Uniapp时，采样乐器声音替换为Base64编码的逻辑。",
		]
	},
	{
		v: "149.0.10",
		data: [
			"优化了字体加载逻辑。",
			"优化了「泛音列」中的提示信息。",
		]
	},
	{
		v: "149.1.1",
		data: [
			"优化了「音程辞典」的界面逻辑。",
			"优化了部分打包逻辑。",
			"修复了部分Bug。",
		]
	},
	{
		v: "149.1.2",
		data: [
			"优化了「音程辞典」的部分逻辑。",
			"优化了打包字体体积和引入逻辑，并改为woff2格式，提高了访问速度。",
			"新增「MIDI信号」功能。",
		]
	},
	{
		v: "150.0.1",
		data: [
			"大版本更新：整合功能，新增「超级钢琴」功能，原「MIDI信号」下线。",
			"优化「超级钢琴」的操作逻辑。",
			"优化「超级钢琴」在无MIDI乐器时也能通过点击钢琴键盘发送MIDI信号。",
		]
	},
	{
		v: "150.0.2",
		data: [
			"优化「超级钢琴」在无MIDI乐器时的提示逻辑。",
			"优化「超级钢琴」部分逻辑和界面。",
		]
	},
	{
		v: "150.0.3",
		data: [
			"优化「超级钢琴」的钢琴八度显示。",
			"优化「超级钢琴」在导航的位置。",
		]
	},
	{
		v: "150.1.0",
		data: [
			"功能更新：「节拍与速度」，支持节拍器滴答、打拍子算速度。",
			"优化导航界面统一颜色，微调了部分图标。",
			"UI更新：优化了标题栏的美观程度。",
		]
	},
	{
		v: "151.0.1",
		data: [
			"大版本更新：功能更新：「键盘演奏」，支持在不连接MIDI键盘的情况下，可以使用电脑键盘进行演奏。",
			"功能更新：「键盘演奏」中支持MIDI信号广播，可以将电脑键盘弹奏的MIDI信号发送给支持的端口。（需WebMIDI API支持）",
			"功能更新：在「超级钢琴」中支持通过电脑键盘演奏。",
			"优化了「节拍与速度」中弱拍的声音，调整了音头的大小。",
			"优化了应用导航的顺序。",
			"UI更新：优化了「音程辞典」在某些情况下排版不协调的问题。",
		]
	},
	{
		v: "151.0.2",
		data: [
			"解决了在平板端「超级钢琴」点击键盘的时候，因手势拖拽冲突导致最小化按钮和关闭PC键盘按钮失效的Bug。",
			"解决了在平板端「键盘演奏」选取MIDI信号的时候闪烁的Bug。",
		]
	},
	{
		v: "152.0.1",
		data: [
			"修复了「升降号查询」在预览升降音符时的Bug。",
		]
	},
]

export default updateObj
